tukano-artillery-tests/dbstorage.yaml
#DB STORAGE
config:
  target: https://scc-60485-60492.azurewebsites.net/rest
  plugins:
    metrics-by-endpoint: { } # Used to get metrics for each endpoint individually.
  phases:
    - name: "Main test"    # MAIN TESTS: duration: 30s, with 1 new clients/sec
      duration: 30
      arrivalRate: 1
  payload:
    path: ./data/updated_users.csv
    #loadAll: true # load the whole CSV
    order: sequence # selects users sequentially, default is random
    skipHeader: true # The first line is a header, so we want to skip it
    delimiter: "," # standard delimiter
    skipEmptyLines: true # not important in our case
    fields:
      - "userId"
      - "pwd"
      - "email"
      - "displayName"
      - "random_user_id"
scenarios:
  - name: 'DB Storage'
    weight: 1
    flow:
      # Create users' shorts
      - post:
          url: "/shorts/{{ userId }}?pwd=pwd"
          headers:
            Content-Type: application/json
            Accept: application/json
          capture:
            - json: "$.id"
              as: "id"
      # Follow random user
      - post:
          url: "/shorts/{{ userId }}/{{ random_user_id }}/followers?pwd=pwd"
          headers:
            Content-Type: application/json
          json: true
      # Like short
      - post:
          url: "/shorts/{{ id }}/{{ userId }}/likes?pwd=pwd"
          headers:
            Content-Type: application/json
          json: true
      # Get followers of user
      - get :
          url: "/shorts/{{ userId }}/followers?pwd=pwd"
      # Get likes of short
      - get:
          url: "/shorts/{{ id }}/likes?pwd=pwd"
      # Get feed of user
      - get:
          url: "/shorts/{{ userId }}/feed?pwd=pwd"
      # Get shorts of user
      - get:
          url: "/shorts/{{ userId }}/shorts"
      # Delete user shorts
      - delete:
          url: "/shorts/{{ userId }}/shorts?pwd=pwd"